<template>
  <div class="m-2 text-white text-shadow">
    <h3>Добро пожаловать!</h3>
    <p>
      В данном разделе описаны шаги по добавлению новостей, проектов, каталогов
      и пользователей
    </p>
    <h3>Заполнение новостей</h3>
    <p>
      Чтобы добавить новость нажмите кнопку
      <button type="button" class="btn btn-success me-1">
        Добавить новость
      </button> и в конце списка новостей появится пустая строка, которую необходимо заполнить. При добавлении, новость станет активной и автоматически откроется окно редактирования.
    </p>
    <p></p>
  </div>
</template>

<script>
export default {};
</script>

<style>
</style>