<template>
  <div class="help-objects">
    <h3>Редактирование</h3>
    <p>
      Следующие кнопки используются для взаимодействия с данными
    </p>
    <ul>
      <li class="p-1">
        <button class="btn btn-success"><AddIcon /></button> - Добавить объект
      </li>
      <li class="p-1">
        <button class="btn btn-primary"><SaveIcon /></button> - Сохранить
        изменения
      </li>
      <li class="p-1">
        <button class="btn btn-danger"><CancelIcon /></button> - Отменить
        последние действия (Работает только до сохранения изменений)
      </li>
      <li class="p-1">
        <button class="btn btn-warning"><EditIcon /></button> - Редактировать
        объект
      </li>
      <li class="p-1">
        <button class="btn btn-info"><CopyIcon /></button> - Скопировать ссылку
      </li>
      <li class="p-1">
       <button
            class="btn btn-danger"
            style="z-index: 1"
          >
            <span aria-hidden="true">&times;</span>
          </button> - Удалить объект
    </li>
    </ul>
    <p>
      После добавления объекта необходимо заполнить все поля и добавить
      изображения. Только что добавленный объект становится активным и Вы можете
      приступить к заполнению.
    </p>
    <h3>Новости</h3>
    <p>Поля объекта, помеченные звездочкой <b>*</b>, обязаны быть заполнены.</p>
    <p>
        <ul>
        <li>Дата публикации<b>*</b> - Имеет вид <b>"гггг-мм-дд"</b>. Пример <b>"2021.01.01"</b>. В разделе "Новости портала" сортируются по дате</li>
        <li>Название<b>*</b></li>
        <li>Текст<b>*</b> - Имеет редактор текста</li>
        <li>Изображение</li>
        </ul>
    </p>
    <h3>Каталоги</h3>
    <p>Поля объекта, помеченные звездочкой <b>*</b>, обязаны быть заполнены.</p>
    <p>
        <ul>
        <li>Название каталога<b>*</b>
        <li>Описание каталога<b>*</b> - Имеет редактор текста</li>
        <li>Изображение<b>*</b></li>
        </ul>
    </p>
    <p><b>ВАЖНО!</b> При удалении каталога удаляются и все проекты, которые были к нему прикреплены.</p>
    <h3>Проекты</h3>
    <p>Поля объекта, помеченные звездочкой <b>*</b>, обязаны быть заполнены.</p>
    <p>
        <ul>
        <li>Название проекта<b>*</b>
        <li>Описание проекта<b>*</b> - Имеет редактор текста</li>
        <li>Карта<b>*</b> - Доступные проекты QGIS на сервере</li>
        <li>Каталог<b>*</b> - Доступные каталоги в системе</li>
        </ul>   
    </p>
    <h3>Статьи</h3>
    <p>Поля объекта, помеченные звездочкой <b>*</b>, обязаны быть заполнены.</p>
    <p>
        <ul>
        <li>Название статьи<b>*</b>
        <li>Текст статьи<b>*</b> - Имеет редактор текста</li>
        <li>Изображение</li>
        </ul>   
    </p>
    <h3>Пользователи</h3>
    <p>Поля объекта, помеченные звездочкой <b>*</b>, обязаны быть заполнены.</p>
    <p>
        <ul>
        <li>Имя<b>*</b> - только кириллица
        <li>Фамилия<b>*</b> -  только кириллица</li>
        <li>Логин<b>*</b>- только латиница</li> 
        <li>Пароль<b>*</b> - только латиница, цифры и следующие знаки @.,#!$%^*;:{}=\-_`~()/</li>
        <li>Роль пользователя<b>*</b></li>
        </ul>
    </p>
    <h3>Главная страница</h3>
    <p>Обязательных полей нет</p>
    <p>
        Данный раздел представляет собой плитку из секций. При нажатии на плитку откроется меню, где необходимо указать каталоги, которые будут представлены в секции. 
        Если в секции больше одного каталога, то появится возможность переключать видимые каталоги (карусель).
    </p>
    <h3>Фотогалерея</h3>
    <p>Обязательных полей нет</p>
    <p>
        Данный раздел представляет собой плитку из изображений. При нажатии на кнопку "Добавить" появится модальное окно, для добавления изображения нажмите "Выбрать файлы". Сортировка изображений отсутствует
    </p>
  </div>
</template>

<script>
import SaveIcon from "../../icons/SaveIcon.vue";
import CancelIcon from "../../icons/CancelIcon.vue";
import AddIcon from "../../icons/AddIcon.vue";
import EditIcon from "../../icons/EditIcon.vue";
import CopyIcon from "../../icons/CopyIcon.vue";
export default {
  components: { SaveIcon, AddIcon, CancelIcon, EditIcon, CopyIcon },
};
</script>

<style>
</style>