<template>
  <transition name="fade" mode="out-in">
    <div class="information" v-if="show == true">
      <div class="w-100 text-end p-1">
        <button
          type="button"
          class="btn btn-danger"
          aria-label="Close"
          @click="Close"
        >
          <span aria-hidden="true">&times;</span>
        </button>
      </div>

      <div class="p-2" v-for="(info, index) in information" :key="index">
        <h4>{{ info.name }}</h4>
        <p align="justify">{{ info.text }}</p>
      </div>
    </div>
    <!--  <div style="z-index: 1">
      <button class="btn btn-success" @click="show = true">ЖМИ</button>
    </div> -->
  </transition>
</template>

<script>
export default {
  data() {
    return {
      information: [
        {
          name: "Рыбка",
          text: "Задача организации, в особенности же укрепление и развитие структуры в значительной степени обуславливает создание существенных финансовых и административных условий. Значимость этих проблем настолько очевидна, что постоянный количественный рост и сфера нашей активности играет важную роль в формировании форм развития. Повседневная практика показывает, что постоянный количественный рост и сфера нашей активности играет важную роль в формировании новых предложений. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения направлений прогрессивного развития. С другой стороны сложившаяся структура организации влечет за собой процесс внедрения и модернизации существенных финансовых и административных условий.",
        },
        {
          name: "Животинка",
          text: "Разнообразный и богатый опыт начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки систем массового участия. Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании дальнейших направлений развития. Товарищи! укрепление и развитие структуры представляет собой интересный эксперимент проверки дальнейших направлений развития. Повседневная практика показывает, что начало повседневной работы по формированию позиции способствует подготовки и реализации форм развития. Разнообразный и богатый опыт начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Задача организации, в особенности же начало повседневной работы по формированию позиции способствует подготовки и реализации соответствующий условий активизации.",
        },
      ],
    };
  },
  methods: {
    Close() {
      this.$store.dispatch("changeShow");
    },
  },
  computed: {
    show() {
      return this.$store.getters.getShow;
    },
  },
};
</script>

<style>
.information {
  overflow-y: scroll;
  border-left: white solid 1px;
  flex-shrink: 0;
  z-index: 1;
  width: 350px;
  background: #12355f;
  color: white;
}
</style>